rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
    CLI_printf("PLAY%s\n", (mask & S_REC) ? "-REC" : "");

    Transport_PostButtonPress(mask);
}

void cmd_fwd(int argc, char *argv[])
{
    uint32_t mask = 0;

    if (argc)
    {
        if (strcmp(argv[0], "lib") == 0)
            mask |= M_LIBWIND;
    }

    CLI_printf("FWD%s\n", (mask & M_LIBWIND) ? "-LIB" : "");

    Transport_Fwd(0, mask);
}

void cmd_rew(int argc, char *argv[])
{
    uint32_t mask = 0;

    if (argc)
    {
        if (strcmp(argv[0], "lib") == 0)
            mask |= M_LIBWIND;
    }

    CLI_printf("REW%s\n", (mask & M_LIBWIND) ? "-LIB" : "");

    Transport_Rew(0, mask);
}

void cmd_speed(int argc, char *argv[])
{
    CLI_printf("%u IPS\n", g_sys.tapeSpeed);
}

void cmd_rtz(int argc, char *argv[])
{
    LocateSearch(CUE_POINT_HOME, 0);
}

void cmd_cue(int argc, char *argv[])
{
    int loc = 0;

    if (!argc)
    {
        CLI_printf("CUE MODE\n");
        Remote_PostSwitchPress(SW_CUE, 0);
        return;
    }

    loc = atoi(argv[0]);

    if (g_sys.remoteMode != REMOTE_MODE_CUE)
        Remote_PostSwitchPress(SW_CUE, 0);

    CLI_printf("SEARCH TO CUE MEMORY %d\n", loc);

    switch(loc)
    {
    case 0:
        Remote_PostSwitchPress(SW_LOC0, 0);
        break;
    case 1:
        Remote_PostSwitchPress(SW_LOC1, 0);
        break;
    case 2:
        Remote_PostSwitchPress(SW_LOC2, 0);
        break;
    case 3:
        Remote_PostSwitchPress(SW_LOC3, 0);
        break;
    case 4:
        Remote_PostSwitchPress(SW_LOC4, 0);
        break;
    case 5:
        Remote_PostSwitchPress(SW_LOC5, 0);
        break;
    case 6:
        Remote_PostSwitchPress(SW_LOC6, 0);
        break;
    case 7:
        Remote_PostSwitchPress(SW_LOC7, 0);
        break;
    case 8:
        Remote_PostSwitchPress(SW_LOC8, 0);
        break;
    case 9:
        Remote_PostSwitchPress(SW_LOC9, 0);
        break;
    }
}

void cmd_store(int argc, char *argv[])
{
    int loc = 0;

    if (!argc)
    {
        CLI_printf("STORE MODE\n");
        Remote_PostSwitchPress(SW_STORE, 0);
        return;
    }

    loc = atoi(argv[0]);
    CLI_printf("STORE TO MEMORY to %d\n", loc);

    if (g_sys.remoteMode != REMOTE_MODE_STORE)
        Remote_PostSwitchPress(SW_STORE, 0);

    switch(loc)
    {
    case 0:
        Remote_PostSwitchPress(SW_LOC0, 0);
        break;
    case 1:
        Remote_PostSwitchPress(SW_LOC1, 0);
        break;
    case 2:
        Remote_PostSwitchPress(SW_LOC2, 0);
        break;
    case 3:
        Remote_PostSwitchPress(SW_LOC3, 0);
        break;
    case 4:
        Remote_PostSwitchPress(SW_LOC4, 0);
        break;
    case 5:
        Remote_PostSwitchPress(SW_LOC5, 0);
        break;
    case 6:
        Remote_PostSwitchPress(SW_LOC6, 0);
        break;
    case 7:
        Remote_PostSwitchPress(SW_LOC7, 0);
        break;
    case 8:
        Remote_PostSwitchPress(SW_LOC8, 0);
        break;
    case 9:
        Remote_PostSwitchPress(SW_LOC9, 0);
        break;
    }
}

void cmd_smpte(int argc, char *argv[])
{
    if (argc < 1)
    {
        CLI_puts("Missing Argument\n");
        return;
    }

    CLI_puts("SMPTE generator ");

    if (!g_sys.smpteFound)
    {
        CLI_puts("not installed!\n");
        return;
    }

    if (strcmp(argv[0], "start") == 0)
    {
        SMPTE_generator_start();
        CLI_puts("START\n");
    }
    else if (strcmp(argv[0], "stop") == 0)
    {
        SMPTE_generator_stop();
        CLI_puts("STOP\n");
    }
    else if (strcmp(argv[0], "resume") == 0)
    {
        SMPTE_generator_resume();
        CLI_puts("RESUME\n");
    }
    else if (strcmp(argv[0], "revid") == 0)
    {
        char buf[16];
        uint16_t revid = 0;
        SMPTE_get_revid(&revid);
        sprintf(buf, "REVID %04X\n", revid);
        CLI_puts(buf);
    }
    else
    {
        CLI_puts("\n\nUsage: smpte {start|stop|resume|revid}\n");
    }
}

//*****************************************************************************
// Time and Date Commands
//*****************************************************************************

void cmd_time(int argc, char *argv[])
{
    char timeFmt[] = "Current time: %d:%02d:%02d\n";
    char timeSet[] = "Time set!\n";
    char timeAs[]  = "Enter time as: hh:mm:ss\n";

    if (g_sys.rtcFound)
    {
        RTCC_Struct ts;

        if (argc == 0)
        {
            if (!IsClockRunning())
                return;

            MCP79410_GetTime(g_sys.handleRTC, &ts);

            CLI_printf(timeFmt, ts.hour, ts.min, ts.sec);
        }
        else if (argc == 3)
        {
            /* Get current time/date */
            MCP79410_GetTime(g_sys.handleRTC, &ts);

            ts.hour    = (uint8_t)atoi(argv[0]);
            ts.min     = (uint8_t)atoi(argv[1]);
            ts.sec     = (uint8_t)atoi(argv[2]);

            MCP79410_SetHourFormat(g_sys.handleRTC, H24);                // Set hour format to military time standard
            MCP79410_EnableVbat(g_sys.handleRTC);                        // Enable battery backup
            MCP79410_SetTime(g_sys.handleRTC, &ts);
            MCP79410_EnableOscillator(g_sys.handleRTC);                  // Start clock by enabling oscillator

            CLI_puts(timeSet);
        }
        else
        {
            CLI_puts(timeAs);
        }
    }
    else
    {
        struct tm stime;

        if (argc == 0)
        {
            // Get the latest time.
            HibernateCalendarGet(&stime);

            // Is valid data read?
            if (!IsValidTime(&stime))
            {
                CLI_puts("Time has not been set yet\n");
            }
            else
            {
                CLI_printf(timeFmt, stime.tm_hour, stime.tm_min, stime.tm_sec);
            }
        }
        else if (argc == 3)
        {
            // Get the latest date and time.
            HibernateCalendarGet(&stime);

            // Set the time values that are to be updated.
            stime.tm_hour = atoi(argv[0]);
            stime.tm_min  = atoi(argv[1]);
            stime.tm_sec  = atoi(argv[2]);

            // Update the calendar logic of hibernation module.
            HibernateCalendarSet(&stime);

            CLI_puts(timeSet);
        }
        else
        {
            CLI_puts(timeAs);
        }
    }
}

