rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
void cmd_date(int argc, char *argv[])
{
    char dateFmt[] = "Current date: %d/%d/%d\n";
    char dateSet[] = "Date set!\n";
    char dateAs[]  = "Enter date as: mm/dd/yyyy\n";

    if (g_sys.rtcFound)
     {
        RTCC_Struct ts;

        if (argc == 0)
        {
            if (!IsClockRunning())
                return;

            MCP79410_GetTime(g_sys.handleRTC, &ts);

            CLI_printf(dateFmt, ts.month, ts.date, ts.year+2000);
        }
        else if (argc == 3)
        {
            /* Get current time/date */
            MCP79410_GetTime(g_sys.handleRTC, &ts);

            ts.month   = (uint8_t)atoi(argv[0]);
            ts.date    = (uint8_t)atoi(argv[1]);
            ts.year    = (uint8_t)(atoi(argv[2]) - 2000);
            ts.weekday = (uint8_t)((ts.date % 7) + 1);

            MCP79410_SetHourFormat(g_sys.handleRTC, H24);                // Set hour format to military time standard
            MCP79410_EnableVbat(g_sys.handleRTC);                        // Enable battery backup
            MCP79410_SetTime(g_sys.handleRTC, &ts);
            MCP79410_EnableOscillator(g_sys.handleRTC);                  // Start clock by enabling oscillator

            CLI_puts(dateSet);
        }
        else
        {
            CLI_puts(dateAs);
        }
     }
    else
    {
        struct tm stime;

        if (argc == 0)
        {
            // Get the latest time.
            HibernateCalendarGet(&stime);

            // Is valid data read?
            if (!IsValidDate(&stime))
            {
                CLI_puts("Date has not been set yet\n");
            }
            else
            {
                CLI_printf(dateFmt,
                           stime.tm_mon,
                           stime.tm_mday,
                           stime.tm_year + 1900);
            }
        }
        else if (argc == 3)
        {
            // Get the latest date and time.
            HibernateCalendarGet(&stime);

            // Set the date values that are to be updated.
            stime.tm_mon  = atoi(argv[0]);
            stime.tm_mday = atoi(argv[1]);
            stime.tm_year = atoi(argv[2]) - 1900;

            // Update the calendar logic of hibernation module.
            HibernateCalendarSet(&stime);

            CLI_puts(dateSet);
        }
        else
        {
            CLI_puts(dateAs);
        }
    }
}

//*****************************************************************************
// Directory and File System Commands
//*****************************************************************************

void cmd_dir(int argc, char *argv[])
{
    static char buf[MAX_PATH];

    CLI_printf("\n Directory of %s\n\n", s_cwd);

    strcpy(buf, ".");

    if (argc >= 1)
    {
        strncpy(buf, argv[0], sizeof(buf)-1);
        buf[sizeof(buf)-1] = 0;
    }

    _dirlist(buf);
}

void cmd_cd(int argc, char *argv[])
{
    FRESULT res;

    if (argc == 1)
    {
        /* Attempt to change to the directory path */
        res = f_chdir(argv[0]);

        _getcwd();

        if (res == FR_OK)
            CLI_printf("%s\n", s_cwd);
        else
            _perror(res);
    }
    else
    {
        _getcwd();

        CLI_printf("%s\n", s_cwd);
    }
}

void cmd_cwd(int argc, char *argv[])
{
    CLI_printf("%s\n", _getcwd());
}

void cmd_mkdir(int argc, char *argv[])
{
    FRESULT res;

    if (argc == 1)
    {
        /* Attempt to make a directory */
        res = f_mkdir(argv[0]);

        if (res == FR_OK)
            CLI_printf("%s\n", argv[0]);
        else
            _perror(res);
    }
}

void cmd_unlink(int argc, char *argv[])
{
    FRESULT res;

    if (argc == 1)
    {
        /* Attempt to make a directory */
        res = f_unlink(argv[0]);

        if (res == FR_OK)
        {
            CLI_puts("Removed ");
            CLI_puts(argv[0]);
            CLI_putc('\n');
        }
        else
        {
            _perror(res);
        }
    }
}

//*****************************************************************************
// XMODEM File Transfer Commands
//*****************************************************************************

void cmd_xmdm(int argc, char *argv[])
{
    int rc = 0;
    FIL fp;
    FRESULT res = FR_OK;

    char *eraseEOL = VT100_ERASE_EOL;

    CLI_putc('\n');

    if (argc != 2)
    {
        CLI_printf("Usage:\n\n");
        CLI_printf("xmdm s {filename}\t[sends a file]\n");
        CLI_printf("xmdm r {filename}\t[receives a file]\n");
        return;
    }

    if (toupper(*argv[0]) == 'R')
    {
        /* Receive a file */
        if ((res = f_open(&fp, argv[1], FA_WRITE|FA_CREATE_NEW|FA_CREATE_ALWAYS)) == FR_OK)
        {
            CLI_printf("XMODEM Receive Ready\n");

            /* Receive file via XMODEM */
            rc = xmodem_receive(s_handleUart, &fp);

            f_close(&fp);

            if (rc != XMODEM_SUCCESS)
            {
                /* Delete the file, it's not valid */
                f_unlink(argv[1]);

                CLI_printf("\r%s\rReceive Error %d\n", eraseEOL, rc);
            }
            else
            {
                CLI_printf("\r%s\rReceive Complete\n", eraseEOL);
            }
        }
        else
        {
            _perror(res);
        }
    }
    else if (toupper(*argv[0]) == 'S')
    {
        /* Send a file */
        if ((res = f_open(&fp, argv[1], FA_READ)) == FR_OK)
        {
            CLI_printf("XMODEM Send Ready\n");

            /* Send file via XMODEM */
            rc = xmodem_send(s_handleUart, &fp);

            f_close(&fp);

            if (rc != XMODEM_SUCCESS)
            {
                CLI_printf("\r%s\rSend Error %d\n", eraseEOL, rc);
            }
            else
            {
                CLI_printf("\r%s\rSend Complete\n", eraseEOL);
            }
        }
        else
        {
            _perror(res);
        }
    }
    else
    {
        CLI_printf("Invalid Option\n");
    }
}

// End-Of-File
